Tekla.Structures.DirectManipulation.Model.StringExtensions
The Tekla.Structures.DirectManipulation.Model.StringExtensions class provides the extension methods for strings.

Tekla.Structures.DirectManipulation.Model.StringExtensions.ToDistanceString(System.Double)
To the distance string.
target: The distance in millimeters.
Returns: The distance string.